# 문자 변환
NUM_to_HAN = {
    1: '일',
    2: '이',
    3: '삼',
    4: '사',
    5: '오',
    6: '육',
    7: '칠',
    8: '팔',
    9: '구',
    10: '십',
    11: '십일',
    12: '십이',
    13: '십삼',
    14: '십사',
    15: '십오',
    16: '십육',
    17: '십칠',
    18: '십팔',
    19: '십구',
    20: '이십',
}

# 언어 코드
LANGUAGE_CODE = {
    '한국어': 'ko',
    '영어': 'eng',
    '중국어': 'ch',
    '일본어': 'jp', 
    '스페인어': 'sp', 
    '인도네시아어': 'ind', 
    '포르투갈어': 'po', 
}

# RGB values
COLOR = {
    "default": [103, 89, 79],
    "색상1": [100, 163, 111],
    "색상2": [172, 13, 13],
    "색상3": [255, 183, 64]
}

# 파일 경로, 폰트 사이즈
FONT = {
    "default": ["datas/font/TMONBlack.ttf", 70],
    "폰트1": ["datas/font/강원교육모두_Bold.ttf", 80]
}

# 문제 행렬 크기, 좌상단 좌표 값
MATRIX = {
    "size":{
        "25": [1250, 740],
        "30": [1335, 780],
        "35": [1433, 777]
    },
    "pos": {
        "25": [320, 210],
        "30": [285, 185],
        "35": [267, 185]
    },
    "shape": {
        "25": [5, 5],
        "30": [5, 6],
        "35": [5, 7]
    },
}